<template>
    <div>
        <h1>Workout App</h1>

        Todo:
        <ul>
            <li>Создание / редактирование упражнений на странице тренировочных планов (не работает)</li>
            <li>При создании тренировки отдельная кнопка "выбрать из готовых"</li>
        </ul>

        Wishlist:
        <ul>
            <li>Кнопку запуска тренировки на отдельной страничке со списком упражнений (чтобы было видно всё получше и покрупнее) с таймером и всеми пирогами</li>
            <li><s>Количество повторений указывать интервалом (скорее всего просто текстовое поле)</s></li>
            <li>Комментарий ко всему сету</li>
            <li>Количество подходов в сете</li>
            <li>Для упражнения указать целевую группу мышц</li>
        </ul>
    </div>
</template>

<script>
export default {
    name: "Main",
    mounted() {
    },
}
</script>

<style scoped>

</style>
